Revit 2027 API
AnalyticalMember.GetMemberForces Method
 Gets the member forces associated with this Analytical Member.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<MemberForces> GetMemberForces()
Public Function GetMemberForces As IList(Of MemberForces)
public:
IList<MemberForces^>^ GetMemberForces()
member GetMemberForces : unit -> IList<MemberForces>
Return Value
IList<MemberForces>
 Returns a collection of Member Forces associated with this Analytical Member. Empty collection will be returned if Analytical Member doesn't have any Member Forces. To find out with which end member forces are associated use [!:Autodesk::Revit::DB::Structure::MemberForces::Position] property to obtain a position of Member Forces on element.
Remarks
 Member forces are strictly related with releases. This means that we can obtain member forces values only for directions that have releases set to false. Force or moment component on direction that have release set to true is skipped (zeroed) during getting.
Example
/// <summary>
/// Get the meber forces at the start of a beam
/// </summary>
public MemberForces GetStartMemberForces(AnalyticalMember ams)
{
   MemberForces startForces = null;
   if (ams != null)
   {
      IList<MemberForces> beamForces = ams.GetMemberForces();
      foreach (MemberForces forces in beamForces)
      {
         if (forces.Start == true)
         {
            startForces = forces;
            break;
         }
      }
   }
   return startForces;
}
See Also
Reference
AnalyticalMember Class
Autodesk.Revit.DB.Structure Namespace